{
  "intents": [
    {
      "tag": "greeting",
      "patterns": ["Hi", "Hello", "Hey"],
      "responses": ["Hello, how can I help you today?"]
    },
    {
      "tag": "symptoms",
      "patterns": ["I have a headache",
        "My stomach hurts",
        "I feel dizzy",
        "I'm experiencing a throbbing pain in my head. What could it be?",
        "Can you help me understand the symptoms of the flu?",
        "My stomach has been hurting lately. What are the possible causes?",
        "What are the signs of a heart attack?",
        "I have a persistent cough. Is that a symptom of something serious?",
        "What are the early symptoms of diabetes?",
        "Describe the symptoms of seasonal allergies.",
        "I'm feeling fatigued and dizzy. Any idea what might be causing it?",
        "What are the symptoms of a urinary tract infection?",
        "My joints have been aching. Could it be a symptom of arthritis?"],
      "responses": ["I'm sorry to hear that. Can you provide more details about your symptoms?"]
    },
    {
      "tag": "diagnosis",
      "patterns": ["What could be wrong with me?", "Do I have a fever?"],
      "responses": ["Based on your symptoms, it could be X. I recommend consulting a healthcare professional for a proper diagnosis."]
    },
    {
      "tag": "gratitude",
      "patterns": ["Thank you", "Thanks", "Appreciate it"],
      "responses": ["You're welcome. Take care."]
    },
    {
      "tag": "diet",
      "patterns": ["What should I eat to lose weight?", "How many calories should I consume daily?"],
      "responses": ["A balanced diet is essential for weight management. It's recommended to consult a nutritionist for personalized advice."]
    },
    {
      "tag": "food",
      "patterns": ["What are some healthy meal options?", "How can I improve my eating habits?"],
      "responses": ["Incorporating fruits, vegetables, and lean proteins into your meals can contribute to a healthy diet. For personalized guidance, consider consulting a dietitian."]
    },
    {
      "tag": "fitness",
      "patterns": ["What are the best exercises for strength training?", "How often should I work out?"],
      "responses": ["Strength training and cardiovascular exercises are beneficial for overall fitness. It's advisable to seek guidance from a fitness trainer to create a tailored workout plan."]
    }
  ]
}